zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_mdf.c
/*
 * SPDX-FileCopyrightText: Copyright (c) 2026 STMicroelectronics
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_mdf

#include <zephyr/audio/dmic.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/util.h>
#include <soc.h>

#include <stdint.h>
#include <stdlib.h>

LOG_MODULE_REGISTER(st_stm32_mdf, CONFIG_AUDIO_DMIC_LOG_LEVEL);

#define MDF_MAX_FILTERS 6
#define MDF_MAX_SITFS   6

#define MDF_DATA_RES  24
#define MDF_MCICD_MIN 2

struct dmic_stm32_mdf_log10 {
	unsigned int raw; /* Original number */
	unsigned int log; /* 1000 x log10(raw), rounded */
};

struct dmic_stm32_mdf_scales {
	unsigned int scale;
	int gain_db;
};

struct dmic_stm32_mdf_data {
	MDF_HandleTypeDef hmdf;
	MDF_FilterConfigTypeDef filter_config;
	volatile enum dmic_state state;
	struct k_mem_slab *mem_slab;
	struct k_msgq *rx_queue;
	uint16_t block_size;
	uint32_t chan_map;
	uint8_t pcm_width;
	uint16_t buf_pos;
	void *buffer;
};

struct dmic_stm32_mdf_flt_cfg {
	const struct pinctrl_dev_config *pcfg;
	void (*irq_cfg_func)(const struct device *dev);
	const struct device *parent;
};

struct dmic_stm32_mdf_cfg {
	const struct stm32_pclken pclken; /* Peripheral clock */
	const struct stm32_pclken aclken; /* Audio clock */
	const struct reset_dt_spec reset;
};

/* Each filter has its own ISR */
static void dmic_stm32_mdf_isr(const struct device *dev)
{
	struct dmic_stm32_mdf_data *data = dev->data;

	HAL_MDF_IRQHandler(&data->hmdf);
}

void HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hmdf)
{
	struct dmic_stm32_mdf_data *data = CONTAINER_OF(hmdf, struct dmic_stm32_mdf_data, hmdf);

	switch (HAL_MDF_GetError(hmdf)) {
	case MDF_ERROR_NONE:
		LOG_WRN("No error");
		break;
	case MDF_ERROR_ACQUISITION_OVERFLOW:
		LOG_WRN("Acquisition overflow error");
		break;
	case MDF_ERROR_RSF_OVERRUN:
		LOG_WRN("Reshape filter overrun error");
		break;
	case MDF_ERROR_CLOCK_ABSENCE:
		LOG_WRN("Clock absence detection error");
		break;
	case MDF_ERROR_SHORT_CIRCUIT:
		LOG_WRN("Short circuit detection error");
		break;
	case MDF_ERROR_SATURATION:
		LOG_WRN("Saturation detection error");
		break;
	case MDF_ERROR_OUT_OFF_LIMIT:
		LOG_WRN("Out-off limit detection error");
		break;
	case MDF_ERROR_DMA:
		LOG_WRN("DMA error");
		break;
	default:
		LOG_ERR("Unknown error: %d", HAL_MDF_GetError(hmdf));
	}

	data->state = DMIC_STATE_ERROR;
}

/* A 24-bit sample has no limit macros of its own, and BIT() is unsigned */
#define MDF_SAMPLE24_MIN (-(INT32_C(1) << 23))
#define MDF_SAMPLE24_MAX ((INT32_C(1) << 23) - 1)

static void dmic_stm32_mdf_write_sample(uint8_t *dst, uint8_t size, int32_t sample)
{
	switch (size) {
	case 1:
		*dst = (uint8_t)CLAMP(sample, INT8_MIN, INT8_MAX);
		break;
	case 2:
		sys_put_le16((uint16_t)CLAMP(sample, INT16_MIN, INT16_MAX), dst);
		break;
	case 3:
		sys_put_le24((uint32_t)CLAMP(sample, MDF_SAMPLE24_MIN, MDF_SAMPLE24_MAX), dst);
		break;
	default:
		CODE_UNREACHABLE;
	}
}

void HAL_MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf)
{
	struct dmic_stm32_mdf_data *data = CONTAINER_OF(hmdf, struct dmic_stm32_mdf_data, hmdf);
	HAL_StatusTypeDef hal_ret;
	uint8_t sample_size;
	int32_t sample;
	int ret;

	/* FTHF is cleared by reading MDF_DFLTDR until RXFIFO level
	 * is lower than the threshold.
	 * Checking for error after capture value prevents irq deadlock.
	 */
	hal_ret = HAL_MDF_GetAcqValue(hmdf, &sample);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to capture value");
		return;
	}

	if (data->buffer == NULL || data->state == DMIC_STATE_ERROR) {
		return;
	}

	sample_size = DIV_ROUND_UP(data->pcm_width, 8);
	sample >>= MDF_DFLTDR_DR_Pos;

	/* Write sample into current buffer */
	if (data->buf_pos + sample_size <= data->block_size) {
		dmic_stm32_mdf_write_sample((uint8_t *)data->buffer + data->buf_pos, sample_size,
					    sample);
		data->buf_pos += sample_size;
	}

	/* Push full buffer to the queue and allocate a new one */
	if (data->buf_pos >= data->block_size) {
		void *full_buf = data->buffer;

		ret = k_msgq_put(data->rx_queue, &full_buf, K_NO_WAIT);
		if (ret < 0) {
			LOG_ERR("RX queue overflow, dropping full buffer: %d", ret);
			k_mem_slab_free(data->mem_slab, full_buf);
		}

		ret = k_mem_slab_alloc(data->mem_slab, &data->buffer, K_NO_WAIT);
		if (ret < 0) {
			LOG_ERR("Could not allocate next RX buffer: %d", ret);
			data->buffer = NULL;
			data->state = DMIC_STATE_ERROR;
			return;
		}
		data->buf_pos = 0;
	}
}

/*
 * The CIC output data resolution cannot exceed 26 bits.
 * Output data resolution: DS = N * ln(D) / ln(2) + 1 (for serial interface data),
 * where N is filter order and D the CIC decimation factor.
 * Following table gives the maximum decimation ratio for filter order [0..5].
 */
static const unsigned int cic_max_decim_sitf[] = {512, 512, 512, 322, 76, 32};

/*
 * Prime numbers and their 1000 x log10 table.
 * This avoids to need to compute it at runtime.
 */
static const struct dmic_stm32_mdf_log10 log_table[] = {
	{2, 301},    {3, 477},    {5, 699},    {7, 845},   {11, 1041},  {13, 1114},  {17, 1230},
	{19, 1279},  {23, 1362},  {29, 1462},  {31, 1491}, {37, 1568},  {41, 1613},  {43, 1633},
	{47, 1672},  {53, 1724},  {59, 1771},  {61, 1785}, {67, 1826},  {71, 1851},  {73, 1863},
	{79, 1898},  {83, 1919},  {89, 1949},  {97, 1987}, {101, 2004}, {103, 2013}, {107, 2029},
	{109, 2037}, {113, 2053}, {127, 2104},
};

/* Gain (dB) x 10 according to scale value in hex */
static const struct dmic_stm32_mdf_scales scale_table[] = {
	{0x20, -482}, {0x21, -446}, {0x22, -421}, {0x23, -386}, {0x24, -361}, {0x25, -326},
	{0x26, -301}, {0x27, -266}, {0x28, -241}, {0x29, -206}, {0x2A, -181}, {0x2B, -145},
	{0x2C, -120}, {0x2D, -85},  {0x2E, -60},  {0x2F, -25},  {0x00, 0},    {0x01, 35},
	{0x02, 60},   {0x03, 95},   {0x04, 120},  {0x05, 156},  {0x06, 181},  {0x07, 216},
	{0x08, 241},  {0x09, 276},  {0x0A, 301},  {0x0B, 336},  {0x0C, 361},  {0x0D, 396},
	{0x0E, 421},  {0x0F, 457},  {0x10, 482},  {0x11, 517},  {0x12, 542},  {0x13, 577},
	{0x14, 602},  {0x15, 637},  {0x16, 662},  {0x17, 697},  {0x18, 722},
};

static int dmic_stm32_mdf_compute_scale(unsigned int decim, unsigned int order,
					unsigned int data_size)
{
	unsigned long max = ARRAY_SIZE(log_table);
	unsigned int num, d, logd = 0;
	int i, scale;

	/* Decompose decimation ratio D, as prime number factors, to compute log10(D) */
	num = decim;
	while (num > 1) {
		for (i = 0; i < max; i++) {
			d = log_table[i].raw;
			if (!(num % d)) {
				logd += log_table[i].log;
				num = num / d;
				break;
			}
		}
		if (i == max) {
			LOG_WRN("Failed to set scale. Output signal may saturate.");
			return 0;
		}
	}

