zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_mdf.c
	/* scale = 20 * ((DS - 1) * log10(2) - NF * log10(D)) */
	scale = 20 * ((data_size - 1) * log_table[0].log - order * logd);

	return scale;
}

static int dmic_stm32_mdf_compute_params(const struct device *dev, unsigned int decim)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	MDF_FilterConfigTypeDef *flt_cfg = &data->filter_config;
	uint8_t cic_order = flt_cfg->CicMode >> MDF_DFLTCICR_CICMOD_Pos;
	unsigned int decim_cic, decim_rsflt = 1;
	unsigned int data_size = MDF_DATA_RES;
	int i, l, max_scale, scale;

	if (flt_cfg->ReshapeFilter.Activation == ENABLE) {
		decim_rsflt = flt_cfg->ReshapeFilter.DecimationRatio;
		data_size -= 2;
	}

	decim_cic = DIV_ROUND_CLOSEST(decim, decim_rsflt);
	if (!IN_RANGE(decim_cic, MDF_MCICD_MIN, cic_max_decim_sitf[cic_order])) {
		LOG_ERR("Decimation factor [%d] out of range for CIC filter order", decim_cic);
		return -EINVAL;
	}

	/*
	 * Compute scaling:
	 * max scale = 20 * log10( 2 exp DS / D exp NF )
	 * - DS = max data size at scale output (RSFLT on: DS = 22 / RSFLT off: DS = 24)
	 * - NF = Main CIC filter order
	 */
	if (is_power_of_two(decim_cic)) {
		/*
		 * Decimation ratio is a power of 2: D = 2 exp n
		 * max scale = 20 * (DS - n * NF) * log10(2)
		 */
		l = log_table[0].log;

		/* Compute max scale (dB) * 1000 */
		max_scale = 20 * (data_size - 1 - (cic_order * (find_msb_set(decim_cic) - 1))) * l;
	} else {
		/*
		 * Decimation ratio is not a power of 2
		 * max scale = 20 * ((DS - 1) * log10(2) - NF * log10(D))
		 */
		max_scale = dmic_stm32_mdf_compute_scale(decim_cic, cic_order, data_size);
	}

	LOG_DBG("Filter order [%d], decimation [%d], data size [%d], max scale [%d]", cic_order,
		decim_cic, data_size, max_scale / 1000);

	/*
	 * Find scale register setting.
	 * Limit max_scale accuracy to first decimal for comparison with scale table values.
	 */
	max_scale = DIV_ROUND_CLOSEST(max_scale, 100);
	for (i = ARRAY_SIZE(scale_table) - 1; i > 0; i--) {
		if (scale_table[i].gain_db < max_scale) {
			break;
		}
	}
	scale = scale_table[i].scale;

	LOG_DBG("Set scale to [%d]dB: [0x%x]", scale_table[i].gain_db / 10, scale);

	flt_cfg->Gain = scale;
	flt_cfg->DecimationRatio = decim_cic;

	LOG_DBG("Scale [%d], Decimation CIC [%d], Decimation RSFLT [%d]",
		scale, decim_cic, decim_rsflt);

	return 0;
}

/* Reclaim completed buffers still queued for the consumer */
static void dmic_stm32_mdf_purge_rx_queue(struct dmic_stm32_mdf_data *data)
{
	void *buffer;

	while (k_msgq_get(data->rx_queue, &buffer, K_NO_WAIT) == 0) {
		k_mem_slab_free(data->mem_slab, buffer);
	}
}

static int dmic_stm32_mdf_start(const struct device *dev)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;
	int ret;

	/* Reclaim any buffers left queued by a previous (stopped) capture so a
	 * fresh start always begins with the full mem_slab available.
	 */
	dmic_stm32_mdf_purge_rx_queue(data);

	/* Allocate memory slab */
	ret = k_mem_slab_alloc(data->mem_slab, &data->buffer, K_NO_WAIT);
	if (ret < 0) {
		LOG_ERR("Could not allocate RX buffer. Dropping RX data: %d", ret);
		data->state = DMIC_STATE_ERROR;
		return ret;
	}
	data->buf_pos = 0;

	/* Start MDF acquisition */
	hal_ret = HAL_MDF_AcqStart_IT(&data->hmdf, &data->filter_config);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to start MDF %s in IRQ mode", dev->name);
		k_mem_slab_free(data->mem_slab, data->buffer);
		data->buffer = NULL;
		return -EIO;
	}

	data->state = DMIC_STATE_ACTIVE;

	return 0;
}

static int dmic_stm32_mdf_stop(const struct device *dev)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;

	/* Stop MDF acquisition */
	hal_ret = HAL_MDF_AcqStop_IT(&data->hmdf);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to stop MDF in IRQ mode");
		return -EIO;
	}

	/* Conversions and their IRQs are stopped: release the in-flight buffer
	 * the driver still owns so it is not leaked across a stop/start cycle.
	 */
	if (data->buffer != NULL) {
		k_mem_slab_free(data->mem_slab, data->buffer);
		data->buffer = NULL;
	}

	data->state = DMIC_STATE_CONFIGURED;

	return 0;
}

static int dmic_stm32_mdf_deinit(const struct device *dev)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;
	int ret = 0;

	if (data->state == DMIC_STATE_ACTIVE) {
		ret = dmic_stm32_mdf_stop(dev);
		if (ret != 0) {
			return ret;
		}
	}

	hal_ret = HAL_MDF_DeInit(&data->hmdf);
	if (hal_ret != HAL_OK) {
		return -EIO;
	}

	if (data->buffer != NULL) {
		k_mem_slab_free(data->mem_slab, data->buffer);
		data->buffer = NULL;
	}

	/* Drop any completed buffers the consumer never read */
	dmic_stm32_mdf_purge_rx_queue(data);

	data->state = DMIC_STATE_UNINIT;

	return ret;
}

static int dmic_stm32_mdf_init(const struct device *dev)
{
	const struct dmic_stm32_mdf_flt_cfg *cfg = dev->config;
	struct dmic_stm32_mdf_data *data = dev->data;
	int ret;

	/* Configure DT provided pins */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("Could not configure pinctrl: %d", ret);
		return ret;
	}

	/* Run IRQ init */
	cfg->irq_cfg_func(dev);

	data->state = DMIC_STATE_INITIALIZED;

	return 0;
}

static int dmic_stm32_mdf_trigger(const struct device *dev, enum dmic_trigger cmd)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	int ret;

	switch (cmd) {
	case DMIC_TRIGGER_PAUSE:
	case DMIC_TRIGGER_STOP:
		if (data->state == DMIC_STATE_ACTIVE) {
			ret = dmic_stm32_mdf_stop(dev);
			if (ret < 0) {
				return ret;
			}
		}
		data->state = DMIC_STATE_CONFIGURED;
		break;
	case DMIC_TRIGGER_RELEASE:
	case DMIC_TRIGGER_START:
		if (data->state != DMIC_STATE_CONFIGURED) {
			LOG_ERR("Device is not configured");
			return -EIO;
		}

		ret = dmic_stm32_mdf_start(dev);
		if (ret < 0) {
			LOG_ERR("Could not start DMIC");
			return -EIO;
		}
		break;
	case DMIC_TRIGGER_RESET:
		ret = dmic_stm32_mdf_deinit(dev);
		if (ret < 0) {
			LOG_ERR("Could not deinit DMIC");
			return ret;
		}
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}

static int dmic_stm32_mdf_read(const struct device *dev, uint8_t stream, void **buffer,
			       size_t *size, int32_t timeout)
{
	struct dmic_stm32_mdf_data *data = dev->data;
	int ret;

	ARG_UNUSED(stream);

	/* Check if we are in a state that can read */
	if ((data->state != DMIC_STATE_CONFIGURED) && (data->state != DMIC_STATE_ACTIVE) &&
	    (data->state != DMIC_STATE_PAUSED)) {
		LOG_ERR("Device state is not valid for read: %d", data->state);
		return -EIO;
	}

	ret = k_msgq_get(data->rx_queue, buffer, SYS_TIMEOUT_MS(timeout));
	if (ret < 0) {
		return ret;
	}
	*size = data->block_size;

