zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_mdf.c
	return 0;
}

static int dmic_stm32_mdf_configure(const struct device *dev, struct dmic_cfg *cfg)
{
	const struct dmic_stm32_mdf_flt_cfg *drv_cfg = dev->config;
	const struct dmic_stm32_mdf_cfg *parent_cfg = drv_cfg->parent->config;
	struct dmic_stm32_mdf_data *data = dev->data;

	uint32_t best_div = UINT32_MAX, best_proc = 0, best_cck = 0;
	struct pcm_stream_cfg *stream = &cfg->streams[0];
	struct pdm_chan_cfg *channel = &cfg->channel;
	uint32_t d = UINT32_MAX, proc, cck = 1;
	uint32_t bitclk_rate, oversamp;
	uint8_t decim_rsflt, pdm_idx;
	HAL_StatusTypeDef hal_ret;
	uint32_t max, min = 1;
	enum pdm_lr lr = 0;
	int ret = 0;

	if (data->state == DMIC_STATE_ACTIVE) {
		return -EBUSY;
	}

	/* Only one active stream is supported */
	if (channel->req_num_streams != 1) {
		return -EINVAL;
	}

	/* DMIC supports up to 6 active serial interfaces.
	 * Each sitf is mapped to a dedicated filter.
	 */
	if (channel->req_num_chan > MDF_MAX_SITFS || channel->req_chan_map_hi != 0) {
		LOG_ERR("DMIC only supports %u channels or less", MDF_MAX_SITFS);
		return -ENOTSUP;
	}

	if (stream->pcm_rate == 0 || stream->pcm_width == 0) {
		if (data->state == DMIC_STATE_CONFIGURED) {
			ret = dmic_stm32_mdf_deinit(dev);
		}
		return ret;
	}

	if (stream->pcm_width > MDF_DATA_RES) {
		LOG_ERR("DMIC only supports max %u-bit resolution samples", MDF_DATA_RES);
		return -ENOTSUP;
	}

	/* Ensure block size alignment with PCM sample size */
	if ((stream->block_size % DIV_ROUND_UP(stream->pcm_width, 8)) != 0) {
		LOG_ERR("Block size is not aligned with sample width");
		return -EINVAL;
	}

	/* If DMIC was deinitialized, reinit here */
	if (data->state == DMIC_STATE_UNINIT) {
		ret = dmic_stm32_mdf_init(dev);
		if (ret < 0) {
			LOG_ERR("Could not reinit DMIC: %d", ret);
			return ret;
		}
	}

	/* Tear down a previous configuration before reprogramming the channel */
	if (data->state == DMIC_STATE_CONFIGURED) {
		if (HAL_MDF_GetState(&data->hmdf) != HAL_MDF_STATE_RESET) {
			hal_ret = HAL_MDF_DeInit(&data->hmdf);
			if (hal_ret != HAL_OK) {
				LOG_ERR("Failed to deinit filter before reconfiguring");
				return -EIO;
			}
		}
	}

	/* Get Audio clock */
	ret = clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				     (clock_control_subsys_t)&parent_cfg->aclken, &bitclk_rate);
	if (ret < 0) {
		return ret;
	}

	/* Clamp prescaler values to hardware limits
	 * Here min and max represent the product of both prescalers
	 * so PROCDIV * CCKDIV.  Since PROCDIV in [1, 128] and CCKDIV in [1, 16]
	 * then the max values of the product is [1, 2048].
	 */
	min = MAX(1, DIV_ROUND_UP(bitclk_rate, cfg->io.max_pdm_clk_freq));
	max = MIN(2048, bitclk_rate / cfg->io.min_pdm_clk_freq);

	/* No valid prescaler exists */
	if (min > max) {
		return -EINVAL;
	}

	LOG_DBG("min [%d], max [%d]", min, max);

	decim_rsflt = (data->filter_config.ReshapeFilter.Activation == ENABLE)
			      ? data->filter_config.ReshapeFilter.DecimationRatio
			      : 1U;

	for (proc = 1; proc <= 128; proc++) {
		uint32_t cckmin = MAX(1, DIV_ROUND_UP(min, proc));
		uint32_t cckmax = MIN(16, max / proc);

		for (cck = cckmin; cck <= cckmax; cck++) {
			d = proc * cck;

			if (((d % decim_rsflt) == 0U) && (d < best_div)) {
				best_div = d;
				best_proc = proc;
				best_cck = cck;
			}
		}
	}

	if (best_div == UINT32_MAX) {
		LOG_ERR("No valid clock divider found");
		return -EINVAL;
	}

	LOG_DBG("input clock [%d] Hz, procdiv [%d], cckdiv [%d], output clock [%d] Hz",
		bitclk_rate, best_proc, best_cck, bitclk_rate / best_div);

	data->hmdf.Init.CommonParam.ProcClockDivider = best_proc;
	data->hmdf.Init.CommonParam.OutputClock.Divider = best_cck;
	bitclk_rate /= best_div;
	oversamp = DIV_ROUND_CLOSEST(bitclk_rate, stream->pcm_rate);

	ret = dmic_stm32_mdf_compute_params(dev, oversamp);
	if (ret < 0) {
		return ret;
	}

	/* Validate requested L/R pairs before applying hardware limits */
	for (uint8_t chan = 0; chan < channel->req_num_chan; chan += 2) {
		enum pdm_lr lr_0, lr_1;
		uint8_t hw_chan_0, hw_chan_1;

		dmic_parse_channel_map(channel->req_chan_map_lo, channel->req_chan_map_hi, chan,
				       &hw_chan_0, &lr_0);
		if ((chan + 1) < channel->req_num_chan) {
			dmic_parse_channel_map(channel->req_chan_map_lo, channel->req_chan_map_hi,
					       chan + 1, &hw_chan_1, &lr_1);
			if ((lr_0 == lr_1) || (hw_chan_0 != hw_chan_1)) {
				return -EINVAL;
			}
		}
	}

	dmic_parse_channel_map(channel->req_chan_map_lo, 0, 0, &pdm_idx, &lr);

	/* One SIFT per filter */
	channel->act_num_chan = 1;
	channel->act_chan_map_lo = dmic_build_channel_map(0, pdm_idx, lr);
	channel->act_chan_map_hi = 0;
	data->chan_map = channel->act_chan_map_lo;

	/* MDF filter initialization */
	hal_ret = HAL_MDF_Init(&data->hmdf);
	if (hal_ret != HAL_OK) {
		LOG_ERR("MDF initialization failed.");
		return -EIO;
	}

	data->mem_slab = stream->mem_slab;
	data->block_size = stream->block_size;
	data->pcm_width = stream->pcm_width;
	data->state = DMIC_STATE_CONFIGURED;

	return 0;
}

static DEVICE_API(dmic, dmic_stm32_mdf_ops) = {
	.configure = dmic_stm32_mdf_configure,
	.trigger = dmic_stm32_mdf_trigger,
	.read = dmic_stm32_mdf_read,
};

static int dmic_stm32_mdf_clock_init(const struct device *dev)
{
	const struct dmic_stm32_mdf_cfg *cfg = dev->config;
	const struct device *cc_node = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int ret;

	/* Turn on MDF peripheral clock */
	ret = clock_control_on(cc_node, (clock_control_subsys_t)&cfg->pclken);
	if (ret < 0) {
		LOG_ERR("Failed to enable MDF peripheral clock: %d", ret);
		return ret;
	}

	/* Configure MDF kernel clock */
	ret = clock_control_configure(cc_node, (clock_control_subsys_t)&cfg->aclken, NULL);
	if (ret < 0) {
		LOG_ERR("Failed to configure MDF clock: %d", ret);
		return ret;
	}

	return 0;
}

static int dmic_stm32_mdf_pm_init(const struct device *dev)
{
	const struct dmic_stm32_mdf_cfg *cfg = dev->config;
	int ret = 0;

	LOG_DBG("Initializing %s", dev->name);

	/* Turn on MDF peripheral clock */
	ret = dmic_stm32_mdf_clock_init(dev);
	if (ret < 0) {
		LOG_ERR("Could not enable clocks: %d", ret);
		return ret;
	}

	ret = reset_line_toggle_dt(&cfg->reset);
	if (ret < 0) {
		LOG_ERR("Could not toggle reset: %d", ret);
	}

	return ret;
}

static int dmic_stm32_mdf_pm_deinit(const struct device *dev)
{
	const struct dmic_stm32_mdf_cfg *cfg = dev->config;
	int ret = 0;

