zephyrproject-rtos/zephyr/drivers/audio/dmic_stm32_mdf.c
	LOG_DBG("Deinitializing %s", dev->name);

	reset_line_toggle_dt(&cfg->reset);

	/* Turn off MDF peripheral clock */
	ret = clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				(clock_control_subsys_t)&cfg->pclken);
	if (ret < 0) {
		LOG_ERR("Could not disable peripheral clock: %d", ret);
	}

	return ret;
}

static int dmic_stm32_mdf_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return dmic_stm32_mdf_pm_init(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return dmic_stm32_mdf_pm_deinit(dev);
	default:
		return -ENOTSUP;
	}
}

static int dmic_stm32_mdf_device_init(const struct device *dev)
{
	const struct dmic_stm32_mdf_cfg *cfg = dev->config;

	/* Reset MDF */
	if (!device_is_ready(cfg->reset.dev)) {
		LOG_ERR("Reset controller not ready");
		return -ENODEV;
	}

	return pm_device_driver_init(dev, dmic_stm32_mdf_pm_action);
}

#define RESHAPE_FILTER(flt)                                                                        \
	.ReshapeFilter = {                                                                         \
		.Activation = DT_NODE_HAS_PROP(flt, st_reshape_filter_decimation),                 \
		.DecimationRatio = DT_PROP_OR(flt, st_reshape_filter_decimation, 0),               \
	},

#define HIGHPASS_FILTER(flt)                                                                       \
	.HighPassFilter = {                                                                        \
		.Activation = DT_NODE_HAS_PROP(flt, st_highpass_filter_cutoff),                    \
		.CutOffFrequency = DT_PROP_OR(flt, st_highpass_filter_cutoff, 0) <<                \
				   MDF_DFLTRSFR_HPFC_Pos,                                          \
	},

#define MDF_FILTERS_DEFINE(flt)                                                                    \
	PINCTRL_DT_DEFINE(flt);                                                                    \
                                                                                                   \
	K_MSGQ_DEFINE(dmic_stm32_mdf_msgq_##flt, sizeof(void *),                                   \
		      CONFIG_AUDIO_DMIC_STM32_QUEUE_SIZE, 4);                                      \
                                                                                                   \
	static void dmic_stm32_mdf_irq_cfg_func_##flt(const struct device *dev)                    \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQN(flt), DT_IRQ(flt, priority), dmic_stm32_mdf_isr,               \
			    DEVICE_DT_GET(flt), 0);                                                \
		irq_enable(DT_IRQN(flt));                                                          \
	}                                                                                          \
                                                                                                   \
	static const struct dmic_stm32_mdf_flt_cfg dmic_stm32_mdf_cfg_##flt = {                    \
		.irq_cfg_func = dmic_stm32_mdf_irq_cfg_func_##flt,                                 \
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(flt),                                            \
		.parent = DEVICE_DT_GET(DT_PARENT(flt)),                                           \
	};                                                                                         \
                                                                                                   \
	BUILD_ASSERT(DT_PROP(flt, gain) % 3 == 0, "gain must be a multiple of 3 dB");              \
                                                                                                   \
	static const MDF_FilterConfigTypeDef config_##flt = {                                      \
		.DataSource = MDF_DATA_SOURCE_BSMX,                                                \
		.Delay = CONFIG_DMIC_STM32_MDF_DELAY,                                              \
		.CicMode = DT_PROP(flt, filter_order) << MDF_DFLTCICR_CICMOD_Pos,                  \
		.Offset = DT_PROP(flt, offset),                                                    \
		.Gain = DT_PROP(flt, gain) / 3,                                                    \
		RESHAPE_FILTER(flt)                                                                \
		HIGHPASS_FILTER(flt)                                                               \
		.Integrator.Activation = DT_PROP(flt, st_integrator_on),                           \
		.SoundActivity.Activation = DT_PROP(flt, st_sound_activity_on),                    \
		.AcquisitionMode = MDF_MODE_ASYNC_CONT,                                            \
		.FifoThreshold = MDF_FIFO_THRESHOLD_NOT_EMPTY,                                     \
		.DiscardSamples = CONFIG_DMIC_STM32_MDF_DISCARD_SAMPLES,                           \
	};                                                                                         \
                                                                                                   \
	static struct dmic_stm32_mdf_data dmic_stm32_mdf_data_##flt = {                            \
		.hmdf = {                                                                          \
			.Instance = (MDF_Filter_TypeDef *)DT_REG_ADDR(flt),                        \
			.Init = {                                                                  \
				.CommonParam = {                                                   \
					.InterleavedFilters = 0,                                   \
					.OutputClock.Activation = ENABLE,                          \
					.OutputClock.Pins = MDF_OUTPUT_CLOCK_0,                    \
					.OutputClock.Trigger.Activation = DISABLE,                 \
				},                                                                 \
				.SerialInterface = {                                               \
					.Activation = ENABLE,                                      \
					.Mode = MDF_SITF_NORMAL_SPI_MODE,                          \
					.ClockSource = MDF_SITF_CCK0_SOURCE,                       \
					.Threshold = 31,                                           \
				},                                                                 \
				.FilterBistream = UTIL_CAT(UTIL_CAT(MDF_BITSTREAM,                 \
								    DT_NODE_CHILD_IDX(flt)),       \
							   _FALLING),                              \
			},                                                                         \
		},                                                                                 \
		.filter_config = config_##flt,                                                     \
		.rx_queue = &dmic_stm32_mdf_msgq_##flt,                                            \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_DEFINE(flt, dmic_stm32_mdf_init, NULL, &dmic_stm32_mdf_data_##flt,               \
			 &dmic_stm32_mdf_cfg_##flt, POST_KERNEL, CONFIG_AUDIO_DMIC_INIT_PRIORITY,  \
			 &dmic_stm32_mdf_ops);

#define MDF_DEFINE(n)                                                                              \
	PM_DEVICE_DT_INST_DEFINE(n, dmic_stm32_mdf_pm_action);                                     \
                                                                                                   \
	static const struct dmic_stm32_mdf_cfg dmic_stm32_mdf_cfg_##n = {                          \
		.pclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(n, pclk),                               \
		.aclken = STM32_DT_INST_CLOCK_INFO_BY_NAME(n, aclk),                               \
		.reset = RESET_DT_SPEC_INST_GET(n),                                                \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(n, dmic_stm32_mdf_device_init, NULL, NULL, &dmic_stm32_mdf_cfg_##n,  \
			      POST_KERNEL, CONFIG_AUDIO_DMIC_INIT_PRIORITY, NULL);                 \
	DT_INST_FOREACH_CHILD_STATUS_OKAY(n, MDF_FILTERS_DEFINE)

DT_INST_FOREACH_STATUS_OKAY(MDF_DEFINE)
